art/note/j10_shin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-20 Thu 13:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SHIN Java Chapter 10: Threads</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Your Dearest Grandpa" />
<link rel="stylesheet" type="text/css" href="style_for_org.css" />
</head>
<body>
<div id="content">
<h1 class="title">SHIN Java Chapter 10: Threads</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org860314e">1. Threads. First Encounter</a></li>
<li><a href="#org10bcf14">2. <span class="todo TODO">TODO</span> States <code>[0/2]</code></a>
<ul>
<li><a href="#orgac47b70">2.1. Blocked and Waiting states</a></li>
</ul>
</li>
<li><a href="#orgcc51e08">3. <span class="todo TODO">TODO</span> Properties <code>[0/2]</code></a>
<ul>
<li><a href="#org3e4d37c">3.1. Interrupting Threads</a></li>
<li><a href="#org3c0d353">3.2. Daemon Threads</a></li>
<li><a href="#org119f7af">3.3. Thread Names</a></li>
<li><a href="#orgaf0ac9b">3.4. Handlers for Uncaught Exceptions</a></li>
<li><a href="#orgaf8cc2e">3.5. Thread Priority</a></li>
</ul>
</li>
<li><a href="#org0379b4d">4. Synchronization</a>
<ul>
<li><a href="#org07c5693">4.1. Race Condition, First Encounter</a></li>
<li><a href="#orgd9fd1cf">4.2. Lock Objects</a></li>
<li><a href="#orgd699e02">4.3. Conditioning Objects</a></li>
<li><a href="#org6894cc1">4.4. Synchronized Keyword</a></li>
<li><a href="#orgeab30b4">4.5. Synchronized Block</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org860314e" class="outline-2">
<h2 id="org860314e"><span class="section-number-2">1</span> Threads. First Encounter</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2023-04-19 Wed 19:37] </span></span> <br />
The method <code>run</code> in the thread should not be called manually. Calling
the run method directly merely executes the task in the same
thread&#x2014;no new thread is started.</li>
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2023-04-19 Wed 19:26] </span></span> <br />
The note should be read after you finish reading the whole section.</li>
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2023-04-19 Wed 19:25] </span></span> <br />
You need to know that there is also a method called <code>run</code> inside of the thread class. However, one shall not define the <code>run</code> by
theire own in order to <i>decouple</i> the task from the thread that execute the task.</li>
</ul>

<p>
What is threads? Threads are seperately executed to enhance the performance. The difference between a thread and a process is that the
threads share the same variables and the memory, which look pretty risky, but on the contrary, the exact feature makes thread light weight. 
</p>

<p>
On the first encounter, let us meet the class <code>bank</code>. It is a class defined by the author of the book to simulate a bank. Inside a
bank, there are some accounts. What <code>transfer</code> do is to transfer certain amount of money from one a count to the other.
</p>

<p>
Okay. We have the following code. 
</p>

<pre class="example">
public interface Runnable {
       void run();
}
</pre>

<p>
It is an interface. Yes. An interface. Why <code>Runnable</code>? You need to know that there is always a function named <code>run</code> to be executed by
the threads. What the interface does is only that the function <code>run</code> is in you class. Anyway, let us continue. 
</p>

<pre class="example">
Runnable r = () -&gt; {
         // code here.
}
</pre>

<p>
You just define a anomynous function using lambda expression. 
</p>

<pre class="example">
var t = new Thread(r);
</pre>

<p>
You just pass the <code>r</code> to a thread, and the thread is called <code>t</code> now. 
</p>

<pre class="example">
t.start();
</pre>

<p>
You just start the thread by calling the function named <code>start</code> inside the thread. 
</p>
</div>
</div>

<div id="outline-container-org10bcf14" class="outline-2">
<h2 id="org10bcf14"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> States <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> the blocked waiting states</li>
<li class="off"><code>[&#xa0;]</code> runnable state</li>
</ul>

<p>
You should learn some words mentioned in the book:
</p>

<ul class="org-ul">
<li><i>preempt</i>: The word "preempts" means to take action before someone else can, often by anticipating their actions or intentions. In
a military context, preemption refers to taking the initiative to attack an enemy before they can launch an attack of their own.</li>
<li><i>relinquish</i>: The word "relinquish" means to give up, surrender, or release something. It can refer to letting go of control,
ownership, or responsibility for something or someone. For example, a person may relinquish their rights to a property, relinquish
their position as the leader of a group, or relinquish custody of a child.</li>
<li><i>deprecated</i>: The word "deprecated" is used to describe something that has become outdated, no longer in use, or no longer
supported. It often refers to computer software or programming languages that have been replaced by newer versions or better
alternatives.</li>
</ul>

<p>
There are six states: 
</p>

<ol class="org-ol">
<li>New</li>
<li>Runnable</li>
<li>Blocked</li>
<li>Waiting</li>
<li>Timed waiting</li>
<li>Terminated</li>
</ol>

<p>
When a thread is <code>new</code>-ed, that is to say the thread is initialized, the state of the thread is at <i>new</i>. When one calls the
function <code>start</code>, the thread enters the <i>Runnable</i> state. It means that the thread can be runned (of course). 
</p>

<p>
To understand other states, we need to know what threads should be doing under certain circumstances.
</p>
</div>

<div id="outline-container-orgac47b70" class="outline-3">
<h3 id="orgac47b70"><span class="section-number-3">2.1</span> Blocked and Waiting states</h3>
<div class="outline-text-3" id="text-2-1">
<p>
When the thread tries to acquire an intrinsic object lock that is currently held by another thread, it becomes blocked. It is easy
to understand. That is to say threads is requiring something, but the that thing is being occupied, so that the thread can't do
anything.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcc51e08" class="outline-2">
<h2 id="orgcc51e08"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Properties <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> interrupting threads</li>
<li class="off"><code>[&#xa0;]</code> threads priority</li>
</ul>


<p>
there are some words that you need to know. 
</p>

<ul class="org-ul">
<li><i>squelched</i>: The word "squelched" typically means to forcefully silence or suppress something, such as an idea or a sound.</li>
<li><i>propagate</i>: The word "propagate" generally means to spread or promote an idea, belief, or cause. It can also refer to the process
of reproducing plants or animals through various means such as seeds, cuttings, or cloning. In the context of computer networking,
it can refer to the distribution of data across a network.</li>
</ul>
</div>

<div id="outline-container-org3e4d37c" class="outline-3">
<h3 id="org3e4d37c"><span class="section-number-3">3.1</span> Interrupting Threads</h3>
</div>



<div id="outline-container-org3c0d353" class="outline-3">
<h3 id="org3c0d353"><span class="section-number-3">3.2</span> Daemon Threads</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><i>Daemon</i>: In computing, a daemon (pronounced "demon") is a computer program that runs as a background process rather than being
under direct control of an interactive user. Daemons are typically started at boot time and run continuously in the background,
waiting for specific events or conditions to occur so that they can perform their tasks. Examples of daemons include system
processes such as network services, web servers, and print spoolers. Daemons are often used to provide essential services to other
programs and users without requiring constant attention or interaction.</li>
</ul>
</div>
</div>


<div id="outline-container-org119f7af" class="outline-3">
<h3 id="org119f7af"><span class="section-number-3">3.3</span> Thread Names</h3>
<div class="outline-text-3" id="text-3-3">
<p>
threads have names. You can use a method of the thread to change its name. 
</p>
</div>
</div>

<div id="outline-container-orgaf0ac9b" class="outline-3">
<h3 id="orgaf0ac9b"><span class="section-number-3">3.4</span> Handlers for Uncaught Exceptions</h3>
<div class="outline-text-3" id="text-3-4">
<p>
You can set the Exceptions handler by passing an object where there is a handler method defined in it.
</p>
</div>
</div>

<div id="outline-container-orgaf8cc2e" class="outline-3">
<h3 id="orgaf8cc2e"><span class="section-number-3">3.5</span> Thread Priority</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Thread Priority can be viewed as Legacy. We use the property nowadays.
</p>
</div>
</div>
</div>

<div id="outline-container-org0379b4d" class="outline-2">
<h2 id="org0379b4d"><span class="section-number-2">4</span> Synchronization</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><i>atomic operations</i>: The "atomic operations" means the operations that are not divisible. A non-atomic operation can be divide
into multiple atomic operations.</li>
</ul>
</div>

<div id="outline-container-org07c5693" class="outline-3">
<h3 id="org07c5693"><span class="section-number-3">4.1</span> Race Condition, First Encounter</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The main pointer of this section is to understand what is race condition and realize how a simple race condition can occurred. The
book provides an example of multiple threads being runned on the bank system to transfer money simultaneously, so that something
goes wrong, and is that the balance of the accounts (that is to say the total money) has been lowered. 
</p>

<p>
Why? Because the increment operations in the transfer function is a non-atomic operation, which can be decomposed as (more than)
three operations: 1. load; 2. add; 3. write back. When two increment operations take place simultaneously, in reality, the
atomic operations being carried out should be in a random order, like <code>1 2 1 2 3 3</code>. 
</p>
</div>
</div>

<div id="outline-container-orgd9fd1cf" class="outline-3">
<h3 id="orgd9fd1cf"><span class="section-number-3">4.2</span> Lock Objects</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><i>reentrant</i>: In computer science and mathematics, "reentrant" typically refers to a program or subroutine that can be interrupted
in the middle of its execution and then safely called again before its previous execution has completed.</li>
<li><i>bypass</i>: "bypassed" means to avoid or skip over a particular section of code. A critical section is a portion of code that must
be executed atomically, meaning that it cannot be interrupted or accessed by other threads while it is running.</li>
</ul>

<p>
First thing first: <code>Synchronized</code> keyword is introduced after lock and condition are introduced, because <code>synchronized</code> keyword is
based on lock and condition. The author thinks that it is better to introduce lock and condition first. 
</p>

<p>
Next is the example. It is like you <code>lock</code> the thread and then proceed doing something critical and you don't want race condition
happens. After the critical part is done, you <code>unlock</code> the thread manually. 
</p>
</div>
</div>

<div id="outline-container-orgd699e02" class="outline-3">
<h3 id="orgd699e02"><span class="section-number-3">4.3</span> Conditioning Objects</h3>
<div class="outline-text-3" id="text-4-3">
<p>
You new a Condition in the class bank. It is called <code>sufficientFunds</code>. Like <code>transfer</code> function, it should be not carried if the
<code>amount</code> is less than the balance of the account. When this happens, the thread waits the function <code>await</code> in the condition is
called. You need to <code>signal</code> other thread that awaits, when the balance of an account is renewed. But, you don't know which thread
is at this account, so you use <code>signalAll</code> instead.
</p>

<p>
The difference between <i>block</i> and <i>wait</i> is that you can signal the thread that is waiting.
</p>
</div>
</div>

<div id="outline-container-org6894cc1" class="outline-3">
<h3 id="org6894cc1"><span class="section-number-3">4.4</span> Synchronized Keyword</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li><i>notify</i>: To notify means to inform or give notice to someone about something. It can also imply giving a warning or alerting
someone about an important event or situation. For example, if your flight has been delayed, the airline may notify you by sending
you a text message or email to let you know about the delay.</li>
</ul>

<p>
The function of condition and lock is integrated. And the a function that is prefixed by the <code>synchronized</code> keyword works just like
that using <code>condition</code> and <code>lock</code>. 
</p>

<p>
First, it automatically employs the lock. The function is like: 
</p>
<pre class="example">
public synchronized void foo (){
       // code here
}
</pre>
<p>
And the code inside is equivalent to 
</p>
<pre class="example">
barLock.lock();
try {
    // code here
} finally {
  barLock.unlock();
}
</pre>
<p>
where the function is in the class <code>Bar</code>, where a lock object is defined, using following sentence: 
</p>
<pre class="example">
Lock barLock = new ReentrantLock();
</pre>

<p>
What about conditioning? 
</p>

<p>
When you want to use conditioning, you need to define the condition object in the class. But it is not necessary for synchronized
keyword already provides with you such thing. You may call <code>wait()</code> instead of <code>conditionObject.await()</code>, call <code>notifyAll()</code> instead
of <code>signalAll()</code>
</p>

<p>
When the synchronized keyword is prefixing a static method in a class, it would function differently. The intrinsic lock concerning
is that lock in the class object, but not the instance object.
</p>
</div>
</div>

<div id="outline-container-orgeab30b4" class="outline-3">
<h3 id="orgeab30b4"><span class="section-number-3">4.5</span> Synchronized Block</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li><i>hijack</i>: The word "hijack" means to seize control of a vehicle, aircraft, or other conveyance while it is in transit, typically
with the intention of using it for an unlawful purpose. The term can also be used more broadly to refer to taking control of any
situation or process by force or deception.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Your Dearest Grandpa</p>
<p class="date">Created: 2023-04-20 Thu 13:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>